Jiranuwat-k/ESP32_BTEC_Doorlock_Main/src/main.cpp
#include <Arduino.h>
#include <ESP32Ping.h>
#include "Config.h"
#include "Global.h"
#include "Filehelper.h"
#include "Filehelper.h"
#include "web/style.h"
#include "web/js.h"
#include "web/settings.h"
#include "web/tools.h"
#include "web/index.h"

MFRC522 mfrc522_OUT(SS_PIN, RST_PIN);
AsyncWebServer server(80);
AsyncWebSocket ws("/ws");

// --- AUTHENTICATION GLOBALS ---
String adminSessionUID = ""; // Stores UID of currently logged in admin
String adminSessionRole = ""; // Stores readable role name (MainKey / Admin)

// --- WEB SESSION GLOBALS (New) ---
String webSessionToken = ""; 
const char* SESSION_COOKIE_NAME = "ESPSESSIONID";

// --- ANTI-PASSBACK ---
// We need to keep track of user state in memory for speed, but also in file for persistence
// For this simple implementation, we check file on every scan (might be slow) or load to RAM?
// Given ESP32, RAM is okay for small user base. Let's use File for persistence.
#define STATE_OUTSIDE 0
#define STATE_INSIDE 1

bool checkUserWebAuth(AsyncWebServerRequest *request) {
  if (request->hasHeader("Cookie")) {
    String cookie = request->header("Cookie");
    if (cookie.indexOf(SESSION_COOKIE_NAME + String("=") + webSessionToken) != -1 && webSessionToken != "") {
      return true;
    }
  }
  return false;
}

unsigned long adminSessionTimer = 0;
const unsigned long ADMIN_SESSION_TIMEOUT = 300000; // 5 Minutes auto logout
bool waitingForAdminLogin = false;
unsigned long waitLoginTimer = 0;

Ticker Tick;
DNSServer dns;
ESPAsyncUpdateServer updateServer(&server, LittleFS);
ESPWiFiManager wifimanager(&server, &dns, LittleFS);

uint8_t mfrc522_in_version = 0;
uint8_t mfrc522_out_version = 0;

unsigned long currentMillis = 0;
bool doorActive = false;
unsigned long doorTimer = 0;
const long doorOpenDuration = 8000; // เปิดนาน 8 วินาที

bool successEffectActive = false;
unsigned long successEffectTimer = 0;
const long successEffectDuration = 500;

int deniedBeepState = 0; // 0=นิ่ง, 1-6=ขั้นตอนการดัง
unsigned long deniedBeepTimer = 0;
const long deniedBeepInterval = 100;

void onWsEvent(AsyncWebSocket * server, AsyncWebSocketClient * client, AwsEventType type, void * arg, uint8_t *data, size_t len);
void updateUserState(String uid, int newState);

// --- NETWORK SCANNER GLOBALS ---
bool isScanning = false;
String scanResults = "[]";
int scanProgress = 0;

// Helpers for MAC and Vendor
#include <lwip/etharp.h>
#include <lwip/netif.h>

String getMacFromIp(IPAddress ip) {
    struct eth_addr *mac_ret;
    const ip4_addr_t *ip_ret;
    ip4_addr_t ipaddr;
    IP4_ADDR(&ipaddr, ip[0], ip[1], ip[2], ip[3]);
    
    // Find in ARP cache (only works if we recently contacted them, e.g. Ping)
    ssize_t idx = etharp_find_addr(NULL, &ipaddr, &mac_ret, &ip_ret);
    
    if (idx >= 0) {
        char macStr[18];
        snprintf(macStr, sizeof(macStr), "%02X:%02X:%02X:%02X:%02X:%02X",
                 mac_ret->addr[0], mac_ret->addr[1], mac_ret->addr[2],
                 mac_ret->addr[3], mac_ret->addr[4], mac_ret->addr[5]);
        return String(macStr);
    }
    return "";
}

String getVendor(String mac) {
    if(mac.length() < 8) return "";
    String oui = mac.substring(0, 8); // "XX:XX:XX"
    oui.toUpperCase();
    
    // Simple fast lookup for common IoT
    if(oui.startsWith("24:0A:C4") || oui.startsWith("30:AE:A4") || oui.startsWith("3C:71:BF") || 
       oui.startsWith("54:43:B2") || oui.startsWith("60:01:94") || oui.startsWith("84:0D:8E") ||
       oui.startsWith("A0:20:A6") || oui.startsWith("AC:67:B2") || oui.startsWith("EC:FA:BC")) 
       return "Espressif";
       
    if(oui.startsWith("B8:27:EB") || oui.startsWith("DC:A6:32") || oui.startsWith("E4:5F:01"))
       return "Raspberry Pi";
       
    if(oui.startsWith("00:11:32")) return "Synology";
    if(oui.startsWith("00:1A:11") || oui.startsWith("00:1D:AA")) return "Google";
    
    return "";
}

#include <map>

// ... inside scanTask ...
void scanTask(void * parameter) {
    isScanning = true;
    scanProgress = 0;
    scanResults = "[]"; 
    
    String localRes = "[";
    IPAddress local = WiFi.localIP();
    
    // Map to store IP -> Hostname
    std::map<String, String> hostMap;

    // Helper to query and cache
    auto cacheMdns = [&](const char* service, const char* proto) {
        int n = MDNS.queryService(service, proto);
        for(int m=0; m<n; m++) {
            String ip = MDNS.IP(m).toString();
            String name = MDNS.hostname(m);
            if(name.length() > 0) hostMap[ip] = name;
        }
    };
    
    // Query common services to build hostname database
    // This might take a few seconds total (approx 1s per query call depending on lib)
    cacheMdns("http", "tcp");
    cacheMdns("esp", "tcp");
    cacheMdns("arduino", "tcp");
    cacheMdns("printer", "tcp");
    cacheMdns("googlecast", "tcp");
    cacheMdns("smb", "tcp"); // Windows/Samba

    bool first = true;
    for (int i = 1; i < 255; i++) {
        scanProgress = (i * 100) / 255;
        IPAddress target(local[0], local[1], local[2], i);
        if (target == local) continue;
        
        // Use Ping to check aliveness
        if (Ping.ping(target, 1)) {
             String ipStr = target.toString();
             String mac = getMacFromIp(target);
             String vendor = getVendor(mac);
             
             // Lookup Hostname from our mDNS map
             String hostname = "";
             if(hostMap.count(ipStr)) {
                 hostname = hostMap[ipStr];
             } else {
                 if(vendor == "Espressif") hostname = "ESP32/8266";
                 else if(vendor == "Raspberry Pi") hostname = "Raspberry Pi";
                 else hostname = "Device " + String(i);
             }
             
             if (!first) localRes += ",";
             localRes += "{";
             localRes += "\"ip\":\"" + ipStr + "\",";
             localRes += "\"hostname\":\"" + hostname + "\",";
             localRes += "\"port\":80,";
             localRes += "\"mac\":\"" + mac + "\",";
             localRes += "\"vendor\":\"" + vendor + "\"";
             localRes += "}";
             first = false;
        }
        vTaskDelay(5 / portTICK_PERIOD_MS); 
    }
    
