Jiranuwat-k/ESP32_BTEC_Doorlock_Main/src/main.cpp
    localRes += "]";
    scanResults = localRes;
    
    isScanning = false;
    scanProgress = 100;
    vTaskDelete(NULL);
}

void notFound(AsyncWebServerRequest *request)
{
  request->send(404, "text/plain", "Not found");
}

void initRFIDReader()
{ 
  // mfrc522_IN.PCD_Init(); // Removed - Using WS
  mfrc522_OUT.PCD_Init();
  delay(50);
  // mfrc522_IN.PCD_DumpVersionToSerial();
  mfrc522_OUT.PCD_DumpVersionToSerial();
  // mfrc522_in_version = mfrc522_IN.PCD_ReadRegister(MFRC522::VersionReg);
  mfrc522_out_version = mfrc522_OUT.PCD_ReadRegister(MFRC522::VersionReg);
  Serial.println(F("Scan PICC to see UID"));
}

int initLittleFS()
{
  if (!LittleFS.begin(true))
  {
    Serial.println("An Error has occurred while mounting LittleFS");
    return LittleFS_ERR_MOUNT;
  }
  // 1. readerlogs.txt (Old log.txt)
  File file = LittleFS.open("/readerlogs.txt");
  if (!file)
  {
    Serial.println("readerlogs.txt file doesn't exist");
    Serial.println("Creating file...");
    writeFile(LittleFS, "/readerlogs.txt", "Date,Time,ReaderID,UID,Role,Ref.Verify\n");
  }
  file.close();

  // 2. users.txt
  file = LittleFS.open("/users.txt");
  if (!file)
  {
    Serial.println("users.txt file doesn't exist");
    Serial.println("Creating file...");
    writeFile(LittleFS, "/users.txt", "UID,Role,Prefix,FullNameEN,FullNameTH,Code,Gender,Age,StartDate,ExpireDate\n");
  }
  file.close();

  // 3. userslog.txt
  file = LittleFS.open("/userslog.txt");
  if (!file)
  {
    Serial.println("userslog.txt file doesn't exist");
    Serial.println("Creating file...");
    writeFile(LittleFS, "/userslog.txt", "Date,Time,Event,UID,ModUID\n");
  }
  file.close();

  // 4. systemlog.txt
  file = LittleFS.open("/systemlog.txt");
  if (!file)
  {
    Serial.println("systemlog.txt file doesn't exist");
    Serial.println("Creating file...");
    writeFile(LittleFS, "/systemlog.txt", "Date,Time,Code,Msg\n");
  }
  file.close();

  // 5. usage_stats.txt (New)
  file = LittleFS.open("/usage_stats.txt");
  if (!file)
  {
    Serial.println("usage_stats.txt file doesn't exist");
    Serial.println("Creating file...");
    writeFile(LittleFS, "/usage_stats.txt", "UID,Count,LastAccess\n");
  }
  file.close();

  // 6. user_state.txt (New - Anti-Passback)
  file = LittleFS.open("/user_state.txt");
  if (!file)
  {
    Serial.println("user_state.txt file doesn't exist");
    Serial.println("Creating file...");
    writeFile(LittleFS, "/user_state.txt", "UID,State\n");
  }
  file.close();

  return LittleFS_ERR_OK;
}

void initWifi()
{
  // Connect to Wi-Fi
  wifimanager.on(WM_CONFIG, []() {
  });

  wifimanager.on(WM_ASYNC_CONFIG, [](){
    DefaultHeaders::Instance().addHeader("Access-Control-Allow-Origin", "*");
    Tick.attach_ms(200,[](){
      digitalWrite(LED_BUILTIN,!digitalRead(LED_BUILTIN));
    }); });
  wifimanager.on(WM_SUCCESS, []()
                 {
    if (MDNS.begin("rfid-doorlock")) {
      Serial.println("MDNS started");
    }
    WiFi.hostname("rfid-doorlock");
    Serial.println("Success!");
    Tick.detach();
    digitalWrite(LED_BUILTIN,HIGH); 
  });
  
  updateServer.begin("/update", http_username, http_password);
  wifimanager.setRetryInterval(false); // In Mode Config
  wifimanager.begin("Manager");

  updateServer.on(UPDATE_BEGIN, [](const OTA_UpdateType type, int &result)
                  {
      Serial.print("Update Begin: ");
      Serial.println(type == OTA_UpdateType::OTA_FIRMWARE ? "Firmware" : "Filesystem"); });
  updateServer.on(UPDATE_END, [](const OTA_UpdateType type, int &result)
                  {
      Serial.print("Update End. Result: ");
      Serial.println(result == OTA_UpdateResult::OTA_UPDATE_OK ? "OK" : "Error"); });
  updateServer.begin("/update", http_username, http_password);
}

void initTime()
{
  Serial.println("CInitializing Time");
  struct tm tmstruct;
  delay(2000);
  tmstruct.tm_year = 0;
  getLocalTime(&tmstruct, 5000);
  Serial.printf(
      "Time and Date right now is : %d-%02d-%02d %02d:%02d:%02d\n", (tmstruct.tm_year) + 1900, (tmstruct.tm_mon) + 1, tmstruct.tm_mday, tmstruct.tm_hour, tmstruct.tm_min,
      tmstruct.tm_sec);
}

// Connection Beep Globals
int connectBeepState = 0;
unsigned long connectBeepTimer = 0;

// WiFi Config Button Globals
unsigned long configButtonTimer = 0;
bool configButtonActive = false;

// WiFi Reconnect Timer
unsigned long wifiCheckTimer = 0;
const unsigned long wifiCheckInterval = 30000; // Check every 30 seconds

void handlePeripherals()
{
  currentMillis = millis();

  if (doorActive && (currentMillis - doorTimer >= doorOpenDuration)) {
    Serial.println("Door Locked (Time out)");
    digitalWrite(DOORLOCK_PIN, DOORLOCK_OFF);
    doorActive = false;
    ws.textAll("{\"type\":\"door_status\", \"status\":\"locked\"}");
  }

  if (successEffectActive && (currentMillis - successEffectTimer >= successEffectDuration)) {
    digitalWrite(BUZZER_PIN, BUZZER_OFF);
    digitalWrite(LED_STA_PIN, LED_STA_OFF);
    successEffectActive = false;
  }

  // Denied Beep Sequence (Rapid Beeps)
  if (deniedBeepState > 0 && (currentMillis - deniedBeepTimer >= deniedBeepInterval)) {
    deniedBeepTimer = currentMillis; 
    switch (deniedBeepState) {
    case 1: digitalWrite(BUZZER_PIN, BUZZER_ON); digitalWrite(LED_STA_PIN, LED_STA_ON); break;
    case 2: digitalWrite(BUZZER_PIN, BUZZER_OFF); digitalWrite(LED_STA_PIN, LED_STA_OFF); break;
    case 3: digitalWrite(BUZZER_PIN, BUZZER_ON); digitalWrite(LED_STA_PIN, LED_STA_ON); break;
    case 4: digitalWrite(BUZZER_PIN, BUZZER_OFF); digitalWrite(LED_STA_PIN, LED_STA_OFF); break;
    case 5: digitalWrite(BUZZER_PIN, BUZZER_ON); digitalWrite(LED_STA_PIN, LED_STA_ON); break;
    case 6: digitalWrite(BUZZER_PIN, BUZZER_OFF); digitalWrite(LED_STA_PIN, LED_STA_OFF); break;
    }
    deniedBeepState++;
    if (deniedBeepState > 7) deniedBeepState = 0; 
  }

  // Connection Success Sequence (Double Beep)
  if (connectBeepState > 0 && (currentMillis - connectBeepTimer >= 100)) {
       connectBeepTimer = currentMillis;
       switch(connectBeepState) {
           case 1: digitalWrite(BUZZER_PIN, BUZZER_ON); break; // Beep 1
           case 2: digitalWrite(BUZZER_PIN, BUZZER_OFF); break; // Off
           case 3: digitalWrite(BUZZER_PIN, BUZZER_ON); break; // Beep 2
           case 4: digitalWrite(BUZZER_PIN, BUZZER_OFF); break; // Off
       }
       connectBeepState++;
       if(connectBeepState > 4) connectBeepState = 0;
  }

  // WiFi Reset Button Logic (Hold 10s)
  if (digitalRead(CONFIG_BUTTON_PIN) == LOW) {
      if (!configButtonActive) {
          configButtonActive = true;
          configButtonTimer = millis();
          Serial.println("Config Button Pressed...");
      } else {
          unsigned long duration = millis() - configButtonTimer;
          if (duration > 10000) { // 10 Seconds
              Serial.println("Resetting WiFi Settings...");
              // Long Beep Indication
              digitalWrite(BUZZER_PIN, BUZZER_ON); delay(200); digitalWrite(BUZZER_PIN, BUZZER_OFF); delay(100);
              digitalWrite(BUZZER_PIN, BUZZER_ON); delay(200); digitalWrite(BUZZER_PIN, BUZZER_OFF); delay(100);
              digitalWrite(BUZZER_PIN, BUZZER_ON); delay(1000); digitalWrite(BUZZER_PIN, BUZZER_OFF);
              
              wifimanager.reset();
              ESP.restart();
          }
          // Optional: Beep every second to warn user? 
          if(duration > 1000 && (duration / 1000) % 2 == 0) {
             // mild warning tick could go here, but omitted to keep simple
          }
      }
  } else {
      configButtonActive = false;
  }

  // WiFi Connection Check & Reconnect
  if (currentMillis - wifiCheckTimer >= wifiCheckInterval) {
      wifiCheckTimer = currentMillis;
      if (WiFi.status() != WL_CONNECTED) {
          Serial.println("WiFi Connection Lost or Not Connected. Attempting Reconnect...");
          WiFi.reconnect();
      }
  }
}

// *** RESTORED LOGIN HANDLERS (Fix for Logout & Login Page) ***
void setup()
{
  Serial.begin(115200);
  SPI.begin();
  pinMode(BUZZER_PIN, OUTPUT);
  pinMode(LED_STA_PIN, OUTPUT);
  pinMode(DOORLOCK_PIN, OUTPUT);
  pinMode(READER_IN_RST_PIN, OUTPUT); // Configure Reader IN Reset Pin
  pinMode(CONFIG_BUTTON_PIN, INPUT_PULLUP); // BOOT Button
  digitalWrite(BUZZER_PIN, BUZZER_OFF);
  digitalWrite(LED_STA_PIN, LED_STA_OFF);
  digitalWrite(DOORLOCK_PIN, DOORLOCK_OFF);
  digitalWrite(READER_IN_RST_PIN, HIGH); // Default HIGH (Run mode)
  initLittleFS();
  initWifi();
  configTime(3600 * timezone, daysavetime * 3600, "time.nist.gov", "0.pool.ntp.org", "1.pool.ntp.org");
  initTime();
  initRFIDReader();

  // Log Startup with Reason
  esp_reset_reason_t reason = esp_reset_reason();
  String reasonStr;
  switch (reason) {
      case ESP_RST_POWERON: reasonStr = "Power On"; break;
      case ESP_RST_EXT: reasonStr = "External Pin (RST)"; break;
      case ESP_RST_SW: reasonStr = "Software Reset"; break;
      case ESP_RST_PANIC: reasonStr = "Exception/Panic"; break;
      case ESP_RST_INT_WDT: reasonStr = "Interrupt WDT"; break;
      case ESP_RST_TASK_WDT: reasonStr = "Task WDT"; break;
      case ESP_RST_WDT: reasonStr = "Other WDT"; break;
      case ESP_RST_DEEPSLEEP: reasonStr = "Wake Deep Sleep"; break;
      case ESP_RST_BROWNOUT: reasonStr = "Brownout"; break;
      case ESP_RST_SDIO: reasonStr = "SDIO"; break;
      default: reasonStr = "Unknown"; break;
  }

  maintainLogFile(LittleFS, "/systemlog.txt", "Date,Time,Code,Msg");
  appendFile(LittleFS, "/systemlog.txt", (String("INFO,Boot: ") + reasonStr).c_str());

  if (!MDNS.begin("rfid-doorlock")) Serial.println("Error setting up MDNS responder!");
  else { Serial.println("mDNS responder started : rfid-doorlock.local"); MDNS.addService("http", "tcp", 80); }
  
  pinMode(LED_STA_PIN, OUTPUT); pinMode(BUZZER_PIN, OUTPUT); pinMode(DOORLOCK_PIN, OUTPUT);
  digitalWrite(LED_STA_PIN, LED_STA_OFF); digitalWrite(BUZZER_PIN, BUZZER_OFF); digitalWrite(DOORLOCK_PIN, DOORLOCK_OFF);

  // 1. Login Page (GET)
  server.on("/login", HTTP_GET, [](AsyncWebServerRequest *request) {
     String html = "<!DOCTYPE html><html><head><meta name='viewport' content='width=device-width, initial-scale=1'><title>Login</title>";
     html += "<style>";
     html += "body{font-family:'Segoe UI',sans-serif;background:#f0f2f5;display:flex;align-items:center;justify-content:center;height:100vh;margin:0;}";
     html += ".login-card{background:white;padding:40px;border-radius:12px;box-shadow:0 8px 24px rgba(0,0,0,0.1);width:100%;max-width:320px;text-align:center;}";
     html += "h2{margin:0 0 20px;color:#1a73e8;}";
     html += "input{width:100%;padding:12px;margin-bottom:15px;border:1px solid #ddd;border-radius:8px;box-sizing:border-box;font-size:16px;}";
     html += "button{width:100%;padding:12px;background:#1a73e8;color:white;border:none;border-radius:8px;font-size:16px;cursor:pointer;font-weight:600;transition:0.3s;}";
     html += "button:hover{background:#1557b0;}";
     html += ".error{color:red;font-size:14px;display:none;margin-bottom:15px;}";
     html += "</style></head><body>";
     html += "<div class='login-card'><h2>Web Console Login</h2>";
     html += "<p class='error' id='err'>Invalid Username or Password</p>";
     html += "<form onsubmit='event.preventDefault(); login();'>";
     html += "<input type='text' id='user' placeholder='Username' required autocomplete='username'>";
     html += "<input type='password' id='pass' placeholder='Password' required autocomplete='current-password'>";
     html += "<button type='submit'>Login</button></form></div>";
     html += "<script>";
     html += "async function login(){";
     html += " document.getElementById('err').style.display='none';";
     html += " let u=document.getElementById('user').value; let p=document.getElementById('pass').value;";
     html += " try{ let res = await fetch('/api/login/web', {method:'POST', body: new URLSearchParams({user:u, pass:p})});";
     html += " if(res.ok){ window.location.href='/'; } else { document.getElementById('err').style.display='block'; }";
     html += " }catch(e){ alert('Network Error'); }}";
     html += "</script></body></html>";
     request->send(200, "text/html", html);
  });

  // 2. Login Process (POST)
  server.on("/api/login/web", HTTP_POST, [](AsyncWebServerRequest *request) {
     String user = request->hasParam("user", true) ? request->getParam("user", true)->value() : "";
     String pass = request->hasParam("pass", true) ? request->getParam("pass", true)->value() : "";
     
     if(user == http_username && pass == http_password) {
        // Generate Token
        webSessionToken = String(millis()) + String(random(1000,9999));
        AsyncWebServerResponse *response = request->beginResponse(200, "text/plain", "OK");
        response->addHeader("Set-Cookie", String(SESSION_COOKIE_NAME) + "=" + webSessionToken + "; Path=/; Max-Age=3600"); 
        request->send(response);
     } else {
        request->send(401, "text/plain", "Invalid Auth");
     }
  });

  // 3. Logout
  server.on("/logout", HTTP_GET, [](AsyncWebServerRequest *request) {
      webSessionToken = ""; 
      AsyncWebServerResponse *response = request->beginResponse(302, "text/plain", "");
      response->addHeader("Set-Cookie", String(SESSION_COOKIE_NAME) + "=0; Path=/; Max-Age=0");
      response->addHeader("Location", "/login");
      request->send(response);
  });

  // Route for root / web page (SECURED)
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request) {
      if(!checkUserWebAuth(request)) { request->redirect("/login"); return; }
      
