Jiranuwat-k/ESP32_BTEC_Doorlock_Main/src/main.cpp
      // Template Processing
      request->send(200, "text/html", index_html, [](const String& var) -> String {
          if(var == "SETTINGS_SECTION") return String(settings_html); // Inject Settings
          if(var == "TOOLS_SECTION") return String(tools_html); // Inject Tools
          return String();
      }); 
  });

  // Serve Static Assets from PROGMEM
  server.on("/style.css", HTTP_GET, [](AsyncWebServerRequest *request) {
      request->send(200, "text/css", style_css);
  });
  server.on("/script.js", HTTP_GET, [](AsyncWebServerRequest *request) {
      request->send(200, "application/javascript", script_js);
  });

  // PROTECT VIEW ROUTES
  auto checkAuth = [](AsyncWebServerRequest *request, const char* file) {
      if(!checkUserWebAuth(request)) return request->send(401);
      request->send(LittleFS, file, "text/plain", false);
  };

  server.on("/view-log", HTTP_GET, [checkAuth](AsyncWebServerRequest *r){ checkAuth(r, "/readerlogs.txt"); });
  server.on("/view-users", HTTP_GET, [checkAuth](AsyncWebServerRequest *r){ checkAuth(r, "/users.txt"); });
  server.on("/view-userslog", HTTP_GET, [checkAuth](AsyncWebServerRequest *r){ checkAuth(r, "/userslog.txt"); });
  server.on("/view-systemlog", HTTP_GET, [checkAuth](AsyncWebServerRequest *r){ checkAuth(r, "/systemlog.txt"); });
  server.on("/view-usage", HTTP_GET, [checkAuth](AsyncWebServerRequest *r){ checkAuth(r, "/usage_stats.txt"); });
  
  // AUTHENTICATION API (Card)
  server.on("/api/login/wait", HTTP_POST, [](AsyncWebServerRequest *request) {
       waitingForAdminLogin = true;
       waitLoginTimer = millis();
       request->send(200, "text/plain", "Waiting for Admin Card...");
  });

  server.on("/api/login/status", HTTP_GET, [](AsyncWebServerRequest *request) {
       // Check timeout
       if(adminSessionUID != "" && millis() - adminSessionTimer > ADMIN_SESSION_TIMEOUT) {
           adminSessionUID = ""; // Auto logout
       }
       String status = adminSessionUID != "" ? "logged_in" : (waitingForAdminLogin ? "waiting" : "logged_out");
       String display = adminSessionUID != "" ? (adminSessionRole + " (" + adminSessionUID + ")") : "";
       String json = "{\"status\":\"" + status + "\", \"uid\":\"" + display + "\"}";
       request->send(200, "application/json", json);
  });

  server.on("/api/login/logout", HTTP_POST, [](AsyncWebServerRequest *request) {
       adminSessionUID = "";
       adminSessionRole = "";
       request->send(200, "text/plain", "Logged Out");
  });

  // API to get Reader Status
  server.on("/api/readers", HTTP_GET, [](AsyncWebServerRequest *request) {
       auto getVerStr = [](uint8_t v) {
           String s = "0x" + String(v, HEX);
           s.toUpperCase();
           if(v == 0x92) s += " (v2.0)";
           else if(v == 0x91) s += " (v1.0)";
           else if(v == 0x90) s += " (v0.0)";
           else if(v == 0x88) s += " (Clone)";
           else s += " (Unknown)";
           return s;
       };
       String json = "{";
       json += "\"in\":\"" + getVerStr(mfrc522_in_version) + "\",";
       json += "\"out\":\"" + getVerStr(mfrc522_out_version) + "\"";
       json += "}";
       request->send(200, "application/json", json);
  });

  // Board Info
  server.on("/update/boardinfo", HTTP_GET, [](AsyncWebServerRequest *request) {
       long rssi = WiFi.RSSI();
       uint32_t freeHeap = ESP.getFreeHeap();
       uint32_t totalHeap = ESP.getHeapSize();
       unsigned long uptimeSec = millis() / 1000;
       int d = uptimeSec / 86400; int h = (uptimeSec % 86400) / 3600; int m = (uptimeSec % 3600) / 60; int s = uptimeSec % 60;
       String uptime = String(d) + "d " + String(h) + "h " + String(m) + "m " + String(s) + "s";
       String html = "<!DOCTYPE html><html><head><meta name='viewport' content='width=device-width, initial-scale=1'><title>Board Info</title><style>body{font-family:sans-serif;background:#f0f2f5;display:flex;align-items:center;justify-content:center;height:100vh;margin:0}.card{background:white;padding:2rem;border-radius:15px;box-shadow:0 4px 15px rgba(0,0,0,0.1);max-width:400px;width:90%}h2{margin-top:0;color:#333;text-align:center;border-bottom:2px solid #eee;padding-bottom:10px}.item{display:flex;justify-content:space-between;padding:10px 0;border-bottom:1px dashed #eee}.label{color:#666;font-weight:500}.val{font-weight:bold;color:#1a73e8}.btn{display:block;width:100%;padding:10px;text-align:center;background:#1a73e8;color:white;text-decoration:none;border-radius:8px;margin-top:20px;transition:0.3s}.btn:hover{background:#1557b0}</style></head><body><div class='card'><h2>ℹ️ Board Info</h2><div class='item'><span class='label'>Firmware Ver</span><span class='val'>1.0.0</span></div><div class='item'><span class='label'>Free Heap</span><span class='val'>" + String(freeHeap/1024) + " KB</span></div><div class='item'><span class='label'>Total Heap</span><span class='val'>" + String(totalHeap/1024) + " KB</span></div><div class='item'><span class='label'>Uptime</span><span class='val'>" + uptime + "</span></div><div class='item'><span class='label'>WiFi Signal</span><span class='val'>" + String(rssi) + " dBm</span></div><div class='item'><span class='label'>IP Address</span><span class='val'>" + WiFi.localIP().toString() + "</span></div><a href='/' class='btn' onclick='window.close()'>Close</a></div></body></html>";
       request->send(200, "text/html", html);
  });

  // Start Background Scan
  server.on("/api/scan/start", HTTP_POST, [](AsyncWebServerRequest *request) {
      if(isScanning) return request->send(200, "text/plain", "Busy");
      
      // Create Task
      xTaskCreate(
          scanTask,       /* Task function. */
          "ScanTask",     /* String with name of task. */
          4096,           /* Stack size in bytes. */
          NULL,           /* Parameter passed as input of the task */
          1,              /* Priority of the task. */
          NULL);          /* Task handle. */
          
      request->send(200, "text/plain", "Started");
  });

  // Check Status
  server.on("/api/scan/status", HTTP_GET, [](AsyncWebServerRequest *request) {
       // Return JSON with status
       String json = "{";
       json += "\"scanning\":" + String(isScanning ? "true" : "false") + ",";
       json += "\"progress\":" + String(scanProgress) + ",";
       json += "\"data\":" + scanResults;
       json += "}";
       request->send(200, "application/json", json);
  });

