Jiranuwat-k/ESP32_BTEC_Doorlock_Main/src/main.cpp
  // WS Server Status API
  server.on("/api/ws/status", HTTP_GET, [](AsyncWebServerRequest *request) {
      if(!checkUserWebAuth(request)) return request->send(401);
      
      String json = "{";
      json += "\"status\":\"Active\",";
      json += "\"count\":" + String(ws.count());
      json += "}";
      request->send(200, "application/json", json);
  });

  // WS Broadcast API (For Remote Control)
  server.on("/api/ws/broadcast", HTTP_POST, [](AsyncWebServerRequest *request) {
      if(!checkUserWebAuth(request)) return request->send(401);
      
      String msg = request->hasParam("msg", true) ? request->getParam("msg", true)->value() : "";
      if(msg.length() > 0) {
          ws.textAll(msg);
          request->send(200, "text/plain", "Sent: " + msg);
      } else {
          request->send(400, "text/plain", "Empty Message");
      }
  });

  // --- API Action Handler (POST) - SECURED ---
  server.on("/api/action", HTTP_POST, [](AsyncWebServerRequest *request) {
      if(!checkUserWebAuth(request)) return request->send(401, "text/plain", "Session Expired"); // Web Auth First
      
      // Smart Card Auth Check
      if(ENABLE_MAINKEY_SYSTEM && adminSessionUID == "") {
          request->send(401, "text/plain", "Unauthorized: Please scan Admin Card");
          return;
      }
      
      adminSessionTimer = millis(); // Refresh Card Session

      String action = request->hasParam("action", true) ? request->getParam("action", true)->value() : "";
      
      String operatorStr;
      if (adminSessionUID != "") {
          operatorStr = adminSessionRole + " (" + adminSessionUID + ")";
      } else {
          operatorStr = "System/Bypass"; // Default for when MainKey System is disabled
      }

      if(action == "rst_hardware") {
           // Reset External Reader via GPIO
           digitalWrite(READER_IN_RST_PIN, LOW);
           delay(200);
           digitalWrite(READER_IN_RST_PIN, HIGH);
           request->send(200, "text/plain", "Hardware Reset Sent to Reader IN");
      }
      else if(action == "rst_self") {
           request->send(200, "text/plain", "Restarting Main Unit...");
           delay(500);
           ESP.restart();
      }
      else if(action == "clear_log") {
          String type = request->hasParam("type", true) ? request->getParam("type", true)->value() : "";
          
          if(type == "reader") {
              deleteFile(LittleFS, "/readerlogs.txt");
              maintainLogFile(LittleFS, "/systemlog.txt", "Date,Time,Code,Msg");
              appendFile(LittleFS, "/systemlog.txt", (String("INFO,Reader Log Cleared by ") + operatorStr).c_str());
          }
          else if(type == "users") {
              deleteFile(LittleFS, "/userslog.txt");
              maintainLogFile(LittleFS, "/systemlog.txt", "Date,Time,Code,Msg");
              appendFile(LittleFS, "/systemlog.txt", (String("INFO,User Log Cleared by ") + operatorStr).c_str());
          }
          else if(type == "system") {
              if (adminSessionUID != MAIN_KEY_UID) {
                  request->send(403, "text/plain", "Permission Denied: Only MainKey can clear System Logs");
                  return;
              }
              deleteFile(LittleFS, "/systemlog.txt");
          }
          else if(type == "usage") {
              // Only allow clearing if needed, or by admin
              deleteFile(LittleFS, "/usage_stats.txt"); 
              maintainLogFile(LittleFS, "/systemlog.txt", "Date,Time,Code,Msg");
              appendFile(LittleFS, "/systemlog.txt", (String("INFO,Usage Stats Cleared by ") + operatorStr).c_str());
          }
          request->send(200, "text/plain", "Log Cleared by " + operatorStr);
      }
      else if(action == "delete_user") {
          String uid = request->hasParam("uid", true) ? request->getParam("uid", true)->value() : "";
          if(uid != "") {
             deleteUserByUID(LittleFS, "/users.txt", uid);
             maintainLogFile(LittleFS, "/userslog.txt", "Date,Time,Event,UID,ModUID");
             appendFile(LittleFS, "/userslog.txt", (String("D") + "," + operatorStr + "," + uid).c_str());
             request->send(200, "text/plain", "User Deleted");
          } else {
             request->send(400, "text/plain", "Missing UID");
          }
      }
      else if(action == "save_user") {
          String uid = request->hasParam("uid", true) ? request->getParam("uid", true)->value() : "";
          String role = request->hasParam("role", true) ? request->getParam("role", true)->value() : "10";
          if(uid == "") { request->send(400, "text/plain", "Missing UID"); return; }
          if(role == "50" && ENABLE_MAINKEY_SYSTEM && adminSessionUID != MAIN_KEY_UID) {
              request->send(403, "text/plain", "Permission Denied: Only MainKey can create Admins");
              return;
          }
          String prefix = request->hasParam("prefix", true) ? request->getParam("prefix", true)->value() : "XX";
          String fname_en = request->hasParam("fname_en", true) ? request->getParam("fname_en", true)->value() : "-";
          String fname_th = request->hasParam("fname_th", true) ? request->getParam("fname_th", true)->value() : "-";
          String code = request->hasParam("code", true) ? request->getParam("code", true)->value() : "-";
          String gender = request->hasParam("gender", true) ? request->getParam("gender", true)->value() : "-";
          String age = request->hasParam("age", true) ? request->getParam("age", true)->value() : "-";
          String start_date = request->hasParam("start_date", true) ? request->getParam("start_date", true)->value() : "-";
          String end_date = request->hasParam("end_date", true) ? request->getParam("end_date", true)->value() : "-";
          
          fname_en.replace(",", " "); fname_th.replace(",", " "); code.replace(",", " ");
          start_date.replace("T", " "); end_date.replace("T", " ");

          String finalData = uid + "," + role + "," + prefix + "," + fname_en + "," + fname_th + "," + code + "," + gender + "," + age + "," + start_date + "," + end_date;
          String existingUser = getUserDataFromFile(LittleFS, "/users.txt", uid);
          bool isNew = (existingUser == String(FILE_ERR_NOTFOUND) || existingUser == String(FILE_ERR_OPEN));
          upsertUser(LittleFS, "/users.txt", uid, finalData);
          
