Jiranuwat-k/ESP32_BTEC_Doorlock_Main/src/main.cpp
          // Reset Anti-Passback state to allow immediate re-entry
          updateUserState(uid, STATE_OUTSIDE);

          String evt = isNew ? "C" : "M";
          maintainLogFile(LittleFS, "/userslog.txt", "Date,Time,Event,UID,ModUID");
          appendFile(LittleFS, "/userslog.txt", (evt + "," + operatorStr + "," + uid).c_str());
          request->send(200, "text/plain", "User Saved");
      }
      else if(action == "cleanup_expired") {
          if (!AUTO_CLEANUP_EXPIRED_GUESTS) {
              request->send(403, "text/plain", "Auto Cleanup Disabled in Config");
              return;
          }

          File file = LittleFS.open("/users.txt", "r");
          if (!file) { request->send(500, "text/plain", "File Error"); return; }
          
          File temp = LittleFS.open("/users.temp", "w");
          if (!temp) { file.close(); request->send(500, "text/plain", "Temp File Error"); return; }
          
          int count = 0;
          struct tm tmstruct;
          getLocalTime(&tmstruct, 100);
          char currentStr[20];
          snprintf(currentStr, sizeof(currentStr), "%04d-%02d-%02d %02d:%02d", tmstruct.tm_year+1900, tmstruct.tm_mon+1, tmstruct.tm_mday, tmstruct.tm_hour, tmstruct.tm_min);
          String nowStr = String(currentStr);

          // Keep Header
          String header = file.readStringUntil('\n');
          temp.println(header);

          while (file.available()) {
              String line = file.readStringUntil('\n');
              line.trim();
              if (line.length() == 0) continue;
              
              int c1 = line.indexOf(','); 
              int c2 = line.indexOf(',', c1+1);
              
              String role = "";
              if(c2 > 0) role = line.substring(c1+1, c2);
              else if(c1 > 0) role = line.substring(c1+1);
              role.trim();

              bool remove = false;
              if (role == "01") { // Guest
                   // Get Dates (Index 8, 9)
                   int idx = 0; int start = 0;
                   for(int i=0; i<9; i++) {
                       start = line.indexOf(',', start); 
                       if(start == -1) break; 
                       start++;
                   }
                   if(start != -1) {
                       String expireDate = line.substring(start);
                       expireDate.trim();
                       if(nowStr >= expireDate) remove = true;
                   }
              }

              if (remove) {
                  count++;
                  // Log
                  String uid = line.substring(0, c1);
                  maintainLogFile(LittleFS, "/userslog.txt", "Date,Time,Event,UID,ModUID");
                  appendFile(LittleFS, "/userslog.txt", (String("D") + "," + operatorStr + " (Cleanup)," + uid).c_str());
              } else {
                  temp.println(line);
              }
          }
          file.close();
          temp.close();
          LittleFS.remove("/users.txt");
          LittleFS.rename("/users.temp", "/users.txt");
          request->send(200, "text/plain", "Cleanup Complete: Removed " + String(count) + " users");
      }
      else {
          request->send(400, "text/plain", "Unknown Action");
      }
  });

  server.serveStatic("/", LittleFS, "/");
  ws.onEvent(onWsEvent);
  server.addHandler(&ws);
  server.begin();

  // Reset Reader IN when Main Unit is ready to ensure fresh connection
  Serial.println("Main Unit Ready. Resetting Reader IN...");
  digitalWrite(READER_IN_RST_PIN, LOW);
  delay(500); 
  digitalWrite(READER_IN_RST_PIN, HIGH);
  Serial.println("Reader IN Reset Complete.");
}

void openDoor()
{
  digitalWrite(DOORLOCK_PIN, DOORLOCK_ON);
  doorActive = true;
  doorTimer = millis();
  Serial.println("Door Unlocked");
  ws.textAll("{\"type\":\"door_status\", \"status\":\"unlocked\"}");
}

int verifyUID(String uid, String &role, bool isExit) {
  // 1. MAIN KEY CHECK (Always Allowed - Highest Priority)
  if (uid == MAIN_KEY_UID) {
      // If we are in Login Mode (Waiting for Admin Scan)
      if(waitingForAdminLogin) {
           adminSessionUID = uid;
           adminSessionRole = "MainKey"; 
           adminSessionTimer = millis();
           waitingForAdminLogin = false;
           // Double Beep for Login Success
           digitalWrite(BUZZER_PIN, BUZZER_ON); delay(100); digitalWrite(BUZZER_PIN, BUZZER_OFF); delay(100);
           digitalWrite(BUZZER_PIN, BUZZER_ON); delay(200); digitalWrite(BUZZER_PIN, BUZZER_OFF);
           role = "MainKey"; 
           return VERIFY_LOGIN_OK;
      } else {
           // Normal Access - Open Door
            Serial.println("Access Granted (Main Key)");
            // We still allow MainKey to control hardware directly OR let it pass?
            // MainKey bypasses logic? 
            // If MainKey, return OK. But logic below handles AntiPassback for everyone. 
            // Let's assume MainKey OVERRIDES AntiPassback.
            // So we return special code? Or just let it calculate?
            // "MainKey" usually bypasses restrictions.
            // Removed direct hardware control from here. handleReader will do it.
      }
      role = "MainKey"; // IMPORTANT: Set role so log is correct
      return VERIFY_OK;
  }

  // 2. ADMIN LOGIN MODE (Specific Flow for Login Page)
  if (waitingForAdminLogin) {
      if(millis() - waitLoginTimer > 30000) {
           waitingForAdminLogin = false;
           return VERIFY_DENIED; 
      }
      
      // Check if Admin (Read from File)
      String tempRole = getRoleFromFile(LittleFS, "/users.txt", uid);
      if (tempRole.startsWith("-") || tempRole.length() == 0) {
          role = "Unknown";
      } else {
          role = tempRole;
      }

      if (role == Role_Admin) {
           adminSessionUID = uid;
           adminSessionRole = "Admin"; 
           adminSessionTimer = millis();
           waitingForAdminLogin = false;
           digitalWrite(BUZZER_PIN, BUZZER_ON); delay(100); digitalWrite(BUZZER_PIN, BUZZER_OFF);
           return VERIFY_LOGIN_OK;
      }
      
      // Login Failed
      deniedBeepState = 1; deniedBeepTimer = millis();
      return VERIFY_LOGIN_FAIL;
  }

  // 3. NORMAL ACCESS FLOW (Open Door)
  String userData = getUserDataFromFile(LittleFS, "/users.txt", uid);
  
