Jiranuwat-k/ESP32_BTEC_Doorlock_Main/src/main.cpp
  // ERROR HANDLING: If file error (-6, -1), treat as Not Found
  if (userData.startsWith("-") || userData.length() < 2) { 
       role = "Unknown"; 
       deniedBeepState = 1; deniedBeepTimer = millis();
       return VERIFY_NOTFOUND;
  }

  // Parse Role
  int firstComma = userData.indexOf(',');
  int secondComma = userData.indexOf(',', firstComma + 1);
  if(firstComma > 0) {
       if(secondComma > 0) role = userData.substring(firstComma + 1, secondComma);
       else role = userData.substring(firstComma + 1); // Case: UID,Role (End)
       role.trim();
  } else {
       role = "Unknown";
       return VERIFY_NOTFOUND;
  }

  // 3.1 Normal Users / Admins
  if (role == Role_Admin || role == Role_User) {
       // Removed direct hardware control
       return VERIFY_OK;
  }
  
  // 3.2 Guest (Time Limited)
  if (role == Role_Guest) {
      auto getCol = [&](int index) -> String {
          int start = 0;
          for(int i=0; i<index; i++) {
             start = userData.indexOf(',', start); if(start == -1) return ""; start++;
          }
          int end = userData.indexOf(',', start); if (end == -1) end = userData.length();
          return userData.substring(start, end);
      };

      String startDateStr = getCol(8); startDateStr.trim();
      String expireDateStr = getCol(9); expireDateStr.trim();
      
      struct tm tmstruct;
      if(!getLocalTime(&tmstruct, 100)) return VERIFY_INVALID; // Time Sync Error
      
      char currentStr[20];
      snprintf(currentStr, sizeof(currentStr), "%04d-%02d-%02d %02d:%02d", tmstruct.tm_year+1900, tmstruct.tm_mon+1, tmstruct.tm_mday, tmstruct.tm_hour, tmstruct.tm_min);
      String nowStr = String(currentStr);
      
      // Strict Expiry: Expire AS SOON AS the minute matches (Exclusive)
      if (nowStr >= startDateStr && nowStr < expireDateStr) {
          // Removed direct hardware control
          return VERIFY_OK;
      } else {
          deniedBeepState = 1; deniedBeepTimer = millis();

          if (nowStr >= expireDateStr) {
             // Check Grace Period for EXIT
             if (isExit) {
                 int y, M, d, h, m;
                 if(sscanf(expireDateStr.c_str(), "%d-%d-%d %d:%d", &y, &M, &d, &h, &m) == 5) {
                      struct tm expireTm = {0};
                      expireTm.tm_year = y - 1900;
                      expireTm.tm_mon = M - 1;
                      expireTm.tm_mday = d;
                      expireTm.tm_hour = h;
                      expireTm.tm_min = m;
                      expireTm.tm_isdst = -1;
                      
                      time_t tExpire = mktime(&expireTm);
                      time_t tNow = mktime(&tmstruct); // tmstruct populated earlier
                      
                      double diff = difftime(tNow, tExpire);
                      // Grace Period: 30 Minutes (1800 Seconds)
                      if(diff >= 0 && diff <= 1800) {
                           Serial.printf("Guest Expiry Grace Period: %.0f sec (Allowed Exit)\n", diff);
                           return VERIFY_OK; 
                      }
                 }
             }



             // Auto Delete Expired Guest (Verified Expired & No Grace)
             if (AUTO_CLEANUP_EXPIRED_GUESTS) {
                 Serial.println("Guest Expired. Deleting...");
                 deleteUserByUID(LittleFS, "/users.txt", uid);
              
                 // Log deletion
                 maintainLogFile(LittleFS, "/userslog.txt", "Date,Time,Event,UID,ModUID");
                 appendFile(LittleFS, "/userslog.txt", (String("D") + ",System (Expired)," + uid).c_str());
             } else {
                 Serial.println("Guest Expired (Auto Delete Disabled)");
             }
          
             return VERIFY_EXPIRED;
          } else {
             Serial.println("Guest Access: Not Yet Active (or Invalid Range)");
             return VERIFY_DENIED;
          }
      }
  }

  // Fallback (Invalid Role)
  deniedBeepState = 1; deniedBeepTimer = millis();
  return VERIFY_DENIED;
}

// Check if user is already inside (returns true if INSIDE)
bool isUserInside(String uid) {
   String state = getUserDataFromFile(LittleFS, "/user_state.txt", uid);
   if(state.startsWith("-")) return false; // Not found -> default outside
   int comma = state.indexOf(',');
   if(comma > 0) {
       int val = state.substring(comma+1).toInt();
       return (val == STATE_INSIDE);
   }
   return false;
}



void processScan(int ID, String uidString) {
  String role = "";
  long durationSec = 0; // Initialize duration variable
  Serial.print("[" + String(ID) + "] Card UID: ");
  Serial.println(uidString);

  // --- ANTI-PASSBACK CHECK ---
  // Reader 1 = IN, Reader 2 = OUT
  bool allow = false;
  int currentCode = VERIFY_DENIED;

  // Check Permissions First
  String tempRole = "";
  // Pass isExit = true if Reader ID is OUT
  int permCode = verifyUID(uidString, tempRole, (ID == READER_OUT));
  
  // ... inside processScan ...
  String denyReason = "Access Denied"; // Default reason

  // If permission OK, check Direction Logic
  if (permCode == VERIFY_OK) {
      // MainKey bypasses Anti-Passback logic
      if (uidString == MAIN_KEY_UID) {
          allow = true;
          role = tempRole; // Should be "MainKey"
          currentCode = VERIFY_OK;
      } else {
          bool isInside = isUserInside(uidString);
          
          if (ID == READER_IN) { // Tapping IN
               if (isInside) {
                   Serial.println("Anti-Passback: Already Inside!");
                   currentCode = VERIFY_DENIED; 
                   role = tempRole; 
                   denyReason = "Already Inside"; // REASON: Anti-passback
                   // Beep Error
                   deniedBeepState = 1; deniedBeepTimer = millis();
               } else {
                   allow = true;
                   role = tempRole;
                   currentCode = VERIFY_OK;
                   updateUserState(uidString, STATE_INSIDE);
               }
          } 
          else if (ID == READER_OUT) { // Tapping OUT
               if (!isInside) {
                   Serial.println("Anti-Passback: Already Outside (or didn't tap in)!");
                   // STRICT MODE: Deny. 
                   allow = false; 
                   role = tempRole;
                   currentCode = VERIFY_DENIED;
                   denyReason = "Already Outside"; // REASON: Anti-passback
                   deniedBeepState = 1; deniedBeepTimer = millis();
               } else {
                   allow = true; 
                   role = tempRole;
                   currentCode = VERIFY_OK;

                   // --- CALCULATE DURATION BEFORE EXIING ---
                   String stateLine = getUserDataFromFile(LittleFS, "/user_state.txt", uidString);
                   // Line: "AABBCC,1,1712345678"
                   if(stateLine.length() > 0) {
                        int c1 = stateLine.indexOf(',');
                        int c2 = stateLine.lastIndexOf(',');
                        if(c2 > c1) {
                            String tsStr = stateLine.substring(c2+1);
                            time_t entryTime = tsStr.toInt();
                            
                            struct tm now;
                            getLocalTime(&now, 0);
                            time_t exitTime = mktime(&now);
                            
                            if(exitTime > entryTime && entryTime > 0) {
                                durationSec = (long)difftime(exitTime, entryTime);
                            }
                        }
                   }

                   updateUserState(uidString, STATE_OUTSIDE);
                   
                   // *** COUNT USAGE ON EXIT ONLY ***
                   updateUsageStats(LittleFS, "/usage_stats.txt", uidString);
               }
          }
      }
  } else {
      currentCode = permCode;
      role = tempRole; 
      // Map Verify Codes to Text
      if(permCode == VERIFY_NOTFOUND) denyReason = "User Not Found";
      else if(permCode == VERIFY_EXPIRED) denyReason = "Card Expired";
      else if(permCode == VERIFY_INVALID) denyReason = "Time Invalid";
      else if(permCode == VERIFY_LOGIN_FAIL) denyReason = "Login Failed";
      else denyReason = "No Permission";
  }

  if (allow) {
      Serial.println("Access Permitted");
      digitalWrite(BUZZER_PIN, BUZZER_ON); delay(200); digitalWrite(BUZZER_PIN, BUZZER_OFF);
      openDoor();

