Jiranuwat-k/ESP32_BTEC_Doorlock_Main/src/main.cpp
      // --- BROADCAST TO WEBSOCKET DISPLAY ---
      // Fetch User Details explicitly since they might not be in scope or passed in fully
      String userDetails = getUserDataFromFile(LittleFS, "/users.txt", uidString);
      
      if (userDetails != "" && userDetails != String(FILE_ERR_NOTFOUND) && userDetails != String(FILE_ERR_OPEN)) {
            // Helper to get Nth field
            auto getField = [](String data, int index) -> String {
                int found = 0;
                int strIndex[] = {0, -1};
                int maxIndex = data.length() - 1;
                for (int i = 0; i <= maxIndex && found <= index; i++) {
                    if (data.charAt(i) == ',' || i == maxIndex) {
                        found++;
                        strIndex[0] = strIndex[1] + 1;
                        strIndex[1] = (i == maxIndex) ? i + 1 : i;
                    }
                }
                return found > index ? data.substring(strIndex[0], strIndex[1]) : "";
            };
            
            String uPrefix = getField(userDetails, 2); // Prefix
            String uName = getField(userDetails, 3); // Name EN
            String uNameTH = getField(userDetails, 4); // Name TH
            String uRole = getField(userDetails, 1); // Role
            String uCode = getField(userDetails, 5); // Code
            String uGender = getField(userDetails, 6); // Gender
            String uAge = getField(userDetails, 7); // Age
            String uExpire = getField(userDetails, 9); // Expire Date (Guest)
            
            // 1. Get Usage Count Helper
            auto getUsageCount = [](fs::FS &fs, const char* path, String uid) -> int {
                 File file = fs.open(path, "r");
                 if(!file) return 0;
                 int count = 0;
                 while(file.available()) {
                    String line = file.readStringUntil('\n');
                    if(line.startsWith(uid + ",")) {
                        int p1 = line.indexOf(',');
                        if(p1 > 0) count = line.substring(p1+1).toInt();
                        break;
                    }
                 }
                 file.close();
                 return count;
            };
            
            // Fetch Count (Naive read)
            int usageCount = getUsageCount(LittleFS, "/usage_stats.txt", uidString);

            // Construct JSON
            String wsJson = "{";
            wsJson += "\"type\":\"scan_event\",";
            wsJson += "\"reader\":" + String(ID) + ",";
            wsJson += "\"uid\":\"" + uidString + "\",";
            wsJson += "\"prefix\":\"" + uPrefix + "\",";
            wsJson += "\"name\":\"" + uName + "\",";
            wsJson += "\"name_th\":\"" + uNameTH + "\",";
            wsJson += "\"role\":\"" + uRole + "\",";
            wsJson += "\"code\":\"" + uCode + "\",";
            wsJson += "\"gender\":\"" + uGender + "\",";
            wsJson += "\"age\":\"" + uAge + "\",";
            wsJson += "\"expire\":\"" + uExpire + "\","; // ADDED EXPIRE DATE
            wsJson += "\"count\":" + String(usageCount) + ",";
            wsJson += "\"duration\":" + String(durationSec); 
            wsJson += "}";
            
            ws.textAll(wsJson);
      }
      
  } else {
      Serial.println("Access Denied");
      
       // Send Denied Event WITH REASON
       String wsJson = "{";
       wsJson += "\"type\":\"scan_deny\",";
       wsJson += "\"reader\":" + String(ID) + ",";
       wsJson += "\"uid\":\"" + uidString + "\",";
       wsJson += "\"code\":" + String(currentCode) + ",";
       wsJson += "\"msg\":\"" + denyReason + "\"";
       wsJson += "}";
       ws.textAll(wsJson);
  }

  maintainLogFile(LittleFS, "/readerlogs.txt", "Date,Time,ReaderID,UID,Role,Ref.Verify");
  int sta = appendFile(LittleFS, "/readerlogs.txt", (String(ID) + "," + uidString + "," + role + "," + String(currentCode)).c_str());

  if (sta != FILE_OK) {
    Serial.printf("Failed to write to readerlogs.txt: %d\n", sta);
  }
  
  // Visual Feedback
  digitalWrite(LED_STA_PIN, LED_STA_ON);
  delay(500); // Visual hold
  digitalWrite(LED_STA_PIN, LED_STA_OFF);
}

// Updated State Manager to handle Timestamp
void updateUserState(String uid, int newState) {
   struct tm tmstruct;
   getLocalTime(&tmstruct, 0);
   time_t now = mktime(&tmstruct);
   
   upsertUser(LittleFS, "/user_state.txt", uid, uid + "," + String(newState) + "," + String(now));
}

void handleReader(int ID, MFRC522 &mfrc522)
{
  if (!mfrc522.PICC_IsNewCardPresent() || !mfrc522.PICC_ReadCardSerial()) {
    return;
  }
  // No delay here, handled in processScan or loop? Original had delay(500). 
  // Let's rely on standard debouncing or just let it flow. 
  // Original had delay(500) AFTER reading.
  // We can put it after process.

  String uidString = "";
  for (byte i = 0; i < mfrc522.uid.size; i++) {
    uidString += String(mfrc522.uid.uidByte[i] < 0x10 ? "0" : "");
    uidString += String(mfrc522.uid.uidByte[i], HEX);
  }
  uidString.toUpperCase();
  
  processScan(ID, uidString);

  mfrc522.PICC_HaltA();
  mfrc522.PCD_StopCrypto1();
}

// Global to track Reader IN client ID
uint32_t readerInClientId = 0;

void onWsEvent(AsyncWebSocket * server, AsyncWebSocketClient * client, AwsEventType type, void * arg, uint8_t *data, size_t len){
  if(type == WS_EVT_CONNECT){
      Serial.printf("WS Client #%u connected from %s\n", client->id(), client->remoteIP().toString().c_str());
      // Audible Notification (Double Beep via State Machine)
      connectBeepState = 1; 
      connectBeepTimer = millis();
  }
  else if(type == WS_EVT_DISCONNECT){
      Serial.printf("WS Client #%u disconnected\n", client->id());
      if(client->id() == readerInClientId) {
          Serial.printf("Reader IN Disconnected! (Client ID: %u)\n", readerInClientId);
          mfrc522_in_version = 0; // Reset version to indicate offline
          readerInClientId = 0;
          
          // Broadcast Reader Status to Web
          String wsJson = "{\"type\":\"reader_status\", \"status\":\"offline\", \"reader\":1}";
          ws.textAll(wsJson);
      }
  }
  else if(type == WS_EVT_DATA){
    AwsFrameInfo * info = (AwsFrameInfo*)arg;
    if(info->final && info->index == 0 && info->len == len){
      String msg = "";
      for(size_t i=0; i<len; i++) msg += (char)data[i];
      
      // Syntax: "UID:AABBCC" or just "AABBCC"
      // Syntax: "VER:146" for version 0x92 (146)
      if(msg.startsWith("VER:")) {
          mfrc522_in_version = msg.substring(4).toInt();
          readerInClientId = client->id(); // Register this client as Reader IN
          Serial.printf("Reader IN Connected! Client ID: %u\n", readerInClientId);
          
          // Broadcast Reader Status to Web
          String wsJson = "{\"type\":\"reader_status\", \"status\":\"online\", \"reader\":1}";
          // Don't send back to the reader itself, only to browsers? Or just textAll (reader will ignore)
          ws.textAll(wsJson);
      }
      else {
          if(msg.startsWith("UID:")) msg = msg.substring(4);
          msg.trim();
          msg.toUpperCase();
          if(msg.length() > 0) processScan(READER_IN, msg);
      }
    }
  }

}

void loop()
{
  ws.cleanupClients();
  handlePeripherals();
  // handleReader(READER_IN, mfrc522_IN); // Handled by WS
  handleReader(READER_OUT, mfrc522_OUT);
}